Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignSettings.ConcreteDesignMethod Property
 The concrete design method.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ConcreteDesignMethod { get; }
Public ReadOnly Property ConcreteDesignMethod As String
	Get
Property Value
Type: String
See Also
Reference
AnalysisDesignSettings Class
Tekla.Structures.Analysis Namespace